{
  "name": "Dervish Dedication",
  "type": "feat",
  "effects": [],
  "system": {
    "description": {
      "value": "<p>You access the vast well of power that resides within your own mind, calling forth psychic magic with nothing but thought and will. You can cast occult spells using the Cast a Spell activity. You are trained in occult spell attacks and occult spell dcs. Your spell attribute is a mental stat of your choice which you select when you take this dedication.</p><p>You gain a focus pool of 2 Focus Points. When you take this archetype, you don't gain focus spells that cost Focus Points to cast. Instead, you use your Focus Points to boost or modify your psi cantrips by applying amps. Each of your psi cantrips has a special amp heading. Whenever you cast a psi cantrip, you can amp it by spending 1 Focus Point to add the amp effect. You refill your focus pool during your daily preparations, and you can regain 1 Focus Point by spending 10 minutes using the Refocus activity to meditate or perform a physical regimen.</p><p>You gain access to the psi cantrips <em>@UUID[Compendium.the-longest-mile.items.VJlZs9QYTW559RCf]</em> and <em>@UUID[Compendium.the-longest-mile.items.8pR0eh4kACzxJilU]</em> which you can modify by spending Focus Points. Like other cantrips, you can cast psi cantrips as often as you like, and they are automatically heightened to half your level rounded up.</p><p><strong>Special</strong> You cannot select another dedication feat until you have gained two other feats from the Dervish archetype.</p>"
    },
    "source": {
      "value": ""
    },
    "rules": [
      {
        "key": "ActiveEffectLike",
        "mode": "upgrade",
        "path": "system.resources.focus.max",
        "priority": 10,
        "value": 2
      }
    ],
    "slug": "dervish-dedication",
    "level": {
      "value": 2
    },
    "traits": {
      "value": ["archetype", "dedication"],
      "rarity": "rare"
    },
    "featType": {
      "value": "archetype"
    },
    "onlyLevel1": false,
    "maxTakable": 1,
    "actionType": {
      "value": "passive"
    },
    "actions": {
      "value": null
    },
    "prerequisites": {
      "value": []
    },
    "location": null
  },
  "img": "systems/pf2e/icons/default-icons/feats.webp",
  "flags": {},
  "_id": "2gf1SGjnUrtXKcYi"
}
